import React, { useState } from "react";
import { View } from "react-native";
import { Text } from "react-native-elements";
import { useRoute } from "@react-navigation/native";
import { ScrollView } from "react-native-gesture-handler";
import { Linking } from "react-native";

const ApplicationDetail = () => {
  const route = useRoute();
  const [applicationListDetails, setApplicationListDetails] = useState([
    {
      name: "Нарахування додаткових балів до стипендіального рейтингу",
      id: 0,
      description:
        "До підсумкової семестрової рейтингової оцінки студента можуть бути додані додаткові бали, які призначаються стипендіальною комісією інституту з урахуванням досягнень протягом семестру, за результатами якого призначається стипендія. Для підрахунку суми додаткових балів, що враховуються у стипендіальному рейтингу, використовується перелік основних досягнень, з яким можна ознайомитись у ПОРЯДКУ формування стипендіального рейтингу студентів НТУ «ХПІ» для призначення академічних стипендій, стор. 7-10.      Для призначення додаткових балів за участь у науковій та науково-технічній діяльності, громадському житті, творчій та спортивній діяльності до стипендіальної комісії інституту в термін не пізніше 3-х днів після закінчення сесії подається заява від студента, візована відповідальними особами (як правило, керівниками структурних підрозділів університету), що гарантують відповідність дійсності такої заяви та додається копія підтверджуючого документу, якщо мається (грамоти, дипломи, звіти, тощо). Такими відповідальними особами можуть бути: з навчально-наукової роботи – завідувачі відповідних кафедр; з суспільно-корисної роботи  – директор Палацу студентів (щодо художньої самодіяльності та культурно-масових заходів), голова студентського самоврядування, голова студентського профкому, голови студентських рад гуртожитків, заступники декана; зі спортивної діяльності – завідувач кафедри Фізичного виховання та спорту.",
      file: "http://www.kpi.kharkov.ua/ukr/wp-content/uploads/sites/2/2018/08/Forma-zavy.pdf",
      fileName:
        "Бланк заяви на призначення додаткових балів до стипендіального рейтингу",
    },
    {
      name: "Зміна джерела фінансування",
      id: 1,
      description:
        "Переведення здобувача вищої освіти Університету, який навчається за Договором або за кошти фізичних та юридичних осіб (контракт) на навчання за рахунок державного замовлення (бюджет) можливе за умови наявності вакантного бюджетного місця за відповідною спеціальністю. Директорат інституту формує рейтинг за відповідною спеціальністю здобувачів вищої освіти з урахуванням академічних досягнень кожного з них за попередній період.",
      toFree:
        "Здобувач вищої освіти, який претендує на вакантне місце державного замовлення, подає до  дирекції інституту  заяву про переведення здобувача на бюджетну форму навчання. Заява оформлюється студентом особисто від руки на бланку заяв, далі візується директором інституту та передається співробітнику дирекції для подальшого оформлення наказу.",
      toPaid:
        "Здобувачу вищої освіти, який навчався на бюджеті і який за підсумками семестрового контролю має академічну неуспішність за кількома навчальними дисциплінами, з урахуванням його досягнень у дослідницькій, науковій, громадській, спортивній та соціально-культурній діяльності інституту та університету може бути надана пропозиція про його переведення на контракт, за умови ліквідації академічної неуспішності до початку наступного семестрового контролю. Переведення здійснюється за  згодою студента на підставі заяви, яка потім предеається до дирекції для подальшої підготовки наказу про переведення.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileName: "Зразок заяви переведення з контракту на бюджет",
      fileContiniue:
        "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileNameContiniue: "Зразок заяви переведення з бюджету на контракт",
    },
    {
      name: "Повторний курс навчання",
      id: 2,
      description:
        "Підставою для надання здобувачу вищої освіти права на повторне навчання може бути невиконання ним, до початку екзаменаційної сесії, навчального плану поточного семестру з поважних причин, які підтверджені відповідними документами.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileName: "Зразок заяви про надання повторного курсу ",
    },
    {
      name: "Нарахування соціальної стипендії",
      id: 3,
      description:
        "Право на соціальну стипендію мають  студенти НТУ “ХПІ”, які за результатами навчального семестру не мають академічної заборгованості, незадовільних результатів навчання, включені до Рейтингу та не отримують академічних стипендій, не перебувають на державному утриманні (крім дітей -сиріт та дітей позбавлених батківського піклування), не пребувають в академічній відпусці, і  відносяться до таких категорій:",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/12/Zayava-na-sotsialnu-stypendiyu.pdf",
      fileContiniue:
        "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/12/Zayava-na-prodovzhennya-vyplaty-sotsialnoyi-stypendiyi.pdf",
      fileName: "Зразок заяви на призначення соціальної стипендії",
      filaNameContiniue:
        "Зразок заяви на продовження виплати соціальної стипендії",
    },
    {
      name: "Відрахування за власним бажанням",
      id: 4,
      description:
        "Відрахування здобувачів вищої освіти оформлюється наказом за підписом ректора (проректора з науково-педагогічної роботи) на підставі подання заяви від здобувача  з резолюцією директора інституту, що засвідчує згоду на відрахування. ",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileName: "Бланк заяви на відрахування за власним бажанням",
    },
    {
      name: "Поновлення до складу студентів (після відрахування)",
      id: 5,
      description:
        "Поновленими до  складу здобувачів вищої освіти НТУ “ХПІ” можуть бути особи, які відраховані до завершення навчання за освітньою (освітньо-професійною, освітньо-науковою) програмою відповідного рівня вищої освіти.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileName: "Бланк заяви про поновлення до ВНЗ",
    },
    {
      name: "Академічна відпустка",
      id: 6,
      description:
        "Здобувач вищої освіти Університету, в незалежності від рівня вищої освіти та форми навчання, може взяти перерву у навчанні у зв’язку з обставинами,  які унеможливлюють виконання освітньої (освітньо-професійної, освітньо-наукової) програми з таких причин:",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileName: "Бланк заяви про надання академвідпустки",
      descriptionContiniue:
        "Допуск на навчання здобувачів вищої освіти, у яких завершився термін академічної відпустки, незалежно від причин переривання навчання, здійснюється наказом Ректора на підставі заяви здобувача до директорату інституту не пізніше двох тижнів до завершення терміну академічної відпустки. Допуск на навчання здобувачів вищої освіти, яким надано академічну відпустку, здійснюється як правило, під час канікул але не пізніше двох тижнів від початку навчального семестру.",
      fileContiniue:
        "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileNameContiniue:
        "Зразок заяви на продовження та повернення академічної відпустки",
    },
    {
      name: "Переведення здобувачів вищої освіти",
      id: 7,
      description:
        "Переведення здобувачів вищої освіти НТУ “ХПІ”, а також здобувачів вищої освіти з інших закладів вищої освіти здійснюється: за денною формою навчання, як правило, під час літніх або зимових канікул; на освітні (освітньо-професійні, освітньо-наукові) програми того самого рівня вищої освіти, на такий самий або молодший навчальний курс; в межах ліцензійного обсягу Університету або іншого закладу вищої освіти (при переведенні здобувачів вищої освіти Університету), відповідного рівня вищої освіти та спеціальності.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/11/BLANK-ZAYAVY.pdf",
      fileName: "Бланк заяви переведення до іншого ВНЗ",
    },
    {
      name: "Зміна особистих даних (прізвища)",
      id: 8,
      description:
        "Студентам, які змінили своє прізвище, необхідно обовязково внести зміни у особисту картку, підставою для внесення змін є заява, написана на відповідному бланку заяв, і  яка подається до дирекції разом зі свідотсвом про шлюб або свідотством про розлучення та копією паспорту.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/12/Zayava-zrazok-na-zminu-prizvyshha.pdf",
      fileName: "Бланк заяви на зміну особистих даних (прізвища)",
    },
    {
      name: "Зняття копії документів, що знаходяться у відділі кадрів",
      id: 9,
      description:
        "Заяви оформлюються студентом особисто від руки, візуються директором інституту та передаються на підпис проректору.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/12/Zayavy-zrazky-dlya-znyattya-kopiyi.pdf",
      fileName:
        "Бланк заяви на зняття копії документів, що знаходяться у відділі кадрів",
    },
    {
      name: "Видача оригінала ЗНО",
      id: 10,
      description:
        "Заяви оформлюються студентом особисто від руки, візуються директором інституту та передаються на підпис проректору.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/12/Zayava-zrazok-na-vydachu-oryginala-ZNO.pdf",
      fileName: "Бланк заяви на видачу оригінала ЗНО",
    },
    {
      name: "Поліпшення оцінки",
      id: 11,
      description:
        "Заяви оформлюються студентом особисто від руки, візуються директором інституту та передаються на підпис проректору.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/12/Zayava-zrazok-na-polipshennya-otsinky.pdf",
      fileName: "Бланк заяви на поліпшення оцінки",
    },
    {
      name: "Перерахування оцінок",
      id: 12,
      description:
        "Перезарахування навчальних дисциплін здійснює  директор інституту, з обовя’зковою згодою викладача дисципліни.",
      file: "http://web.kpi.kharkov.ua/infiz/wp-content/uploads/sites/59/2020/12/Zayava-perezarahuvann-dystsyplin.pdf",
      fileName: "Бланк заяви на перерахування оцінок",
    },
    {
      name: "E-Ticket",
      id: 13,
      description: "",
      file: "",
      fileName: "",
    },
  ]);
  const { apllicationId } = route.params;

  return (
    <View
      style={{
        margin: 10,
      }}
    >
      <View
        style={{
          padding: 10,
          borderRadius: 15,
          borderWidth: 2,
        }}
      >
        <Text
          style={{
            textAlign: "center",
            fontSize: 20,
          }}
        >
          {applicationListDetails[apllicationId].name}
        </Text>
      </View>
      <ScrollView
        style={{
          marginTop: 15,
          marginBottom: 70,
        }}
      >
        <Text
          style={{
            fontSize: 18,
            marginBottom: 5,
          }}
        >
          {applicationListDetails[apllicationId].description}
        </Text>
        <Text
          style={{
            fontSize: 18,
            paddingTop: 5,
          }}
        >
          {applicationListDetails[apllicationId].descriptionContiniue}
        </Text>
        <View
          style={{
            marginTop: 20,
            borderTopWidth: 2,
            paddingTop: 10,
          }}
        >
          <Text
            onPress={() => {
              Linking.openURL(applicationListDetails[apllicationId].file);
            }}
            style={{
              fontSize: 16,
              color: "blue",
              margin: 10,
            }}
          >
            {applicationListDetails[apllicationId].fileName}
          </Text>
          <Text
            onPress={() => {
              Linking.openURL(
                applicationListDetails[apllicationId].fileContiniue
              );
            }}
            style={{
              fontSize: 16,
              color: "blue",
              margin: 10,
            }}
          >
            {applicationListDetails[apllicationId].fileNameContiniue}
          </Text>
        </View>
      </ScrollView>
    </View>
  );
};

export default ApplicationDetail;
